package com.sunesoft.lemon.syms.eHr.domain.attendance.enums;

/**
 * Created by MJ006 on 2016/6/28.
 */
//考勤类型
public enum AttendanceKind {

//    I,//出勤   0
//    T,//探亲   1
//    S1,//休假
//    S2,//护理
//    S3,//事假
//    B1,//病假
//    X1,//学习
//    Y,//野外
//    Z,//出差
//    H,//婚丧
//    S23,//产假
//    G,//工伤
//    X2,//休息
//    W,//劳保
//    K,//旷工
//    B2,//补休

    /*********************新的*********************/
    I,//出勤
    J1,//公休加班   、
    J2,//节日加班   、
    Y,//野外
    Z,//出差
    X1,//学历学习
    X2,//脱产学习   、
    S1,//带薪休假
    L,//疗养
    T,//探亲假
    H,//婚丧假
    G,//工伤假
    C,//产假
    C1,//产后休长假    、
    S2,//护理假，陪护假，计划生育假
    B,//病假
    S3,//事假
    K1,//旷工
    K2,//拘留    、
    K3,//戒毒    、
    W,//劳保
    B2,//补休
    NP,//未打考勤
    WX//周末休息
}
